# PANDAS 4

In [3]:
import numpy as np
import pandas as pd

In [5]:
sozlukVerisi = {'Istanbul' : [30,29,np.nan],'Ankara' : [20,np.nan,25], 'Izmir' : [40,39,38]  }
havaDurumDataFrame = pd.DataFrame(sozlukVerisi)
#Burada bir sozluk verisi olusturduk ve daha sonra bunu dataFrame haline getirdik

In [6]:
havaDurumDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
havaDurumDataFrame.dropna() #eksik verileri silme islemi

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [9]:
havaDurumDataFrame.dropna(axis = 1) #bir onceki durumda satiri silerken simdi ise sutun siliniyor

   Izmir
0     40
1     39
2     38

In [10]:
yeniVeri = {'Istanbul' : [30,29,np.nan],'Ankara' : [20,np.nan,25], 'Izmir' : [40,39,38], 'Antalya' : [45,np.nan,np.nan]  }
yeniDataFrame = pd.DataFrame(yeniVeri)
#asil veriyi icerendataFramei degistirmemek icin yeni bir dataFrame olusturuyoruz

In [11]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [13]:
yeniDataFrame.dropna(axis = 1, thresh = 2)
#thresh verisi girilen deger ve ustu deger olanlari atiyor kalanlari ekrana yaziyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [14]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [19]:
yeniDataFrame.fillna(20) 
#fillna fonksiyonu bos olan kolonlara fonksiyon icine girilen degeri yaziyor

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [40]:
maasSozluk = {'Departman' : ['Yazilim','Yazilim','Pazarlama','Pazarlama','Hukuk','Hukuk'],
'Calisan Ismi' : ['Ahmet','Mehmet','Atil','Burak','Zeynep','Fatma'],
'Maas' : [100,150,200,300,400,500]}

In [41]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [42]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [43]:
grupObjesi = maasDataFrame.groupby("Departman")

In [44]:
grupObjesi.count() #neyden kac taqne oldugunu sayan fonksiyon

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [45]:
grupObjesi.mean() #maaslarin ortlamalarini veren fonksiyon

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazilim    125.0

In [48]:
grupObjesi.max() #max degerler

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazilim         Mehmet   150

In [49]:
grupObjesi.min() #min degerler

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazilim          Ahmet   100